---
kind: method
id: M:Autodesk.Revit.DB.CurtainGridSet.ReverseIterator
source: html/86a0df75-ba39-6c56-a11d-62cafb423a0a.htm
---
# Autodesk.Revit.DB.CurtainGridSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual CurtainGridSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.